#### ✅ Terragrunt Plan
<details><summary>Show Plan</summary>

```
time=2026-01-07T18:43:53Z level=info msg=The stack at /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace-v2



Initializing the backend...

Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to OpenTofu
- Finding latest version of hashicorp/local...

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to OpenTofu
- Reusing previous version of rackerlabs/spot from the dependency lock file
- Reusing previous version of rackerlabs/spot from the dependency lock file
- Finding latest version of hashicorp/local...
- Installing hashicorp/local v2.6.1...
- Installing rackerlabs/spot v0.1.4...
- Installed hashicorp/local v2.6.1 (signed, key ID 0C0AF313E5FD9F80)
- Installing rackerlabs/spot v0.1.4...
- Installed rackerlabs/spot v0.1.4. Signature validation was skipped due to the registry not containing GPG keys for this provider
- Installed rackerlabs/spot v0.1.4. Signature validation was skipped due to the registry not containing GPG keys for this provider

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installing hashicorp/local v2.6.1...
- Installed hashicorp/local v2.6.1 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
spot_cloudspace.this: Refreshing state... [id=matchpoint-runners]
spot_cloudspace.this: Preparing import... [id=matchpoint-github-actions-runners]
spot_cloudspace.this: Refreshing state...
spot_spotnodepool.this: Refreshing state... [id=db6b5a18-41a4-4d75-9ed5-da36cb86f2e2]
spot_spotnodepool.this: Preparing import... [id=e1db3e70-466a-44be-aa7b-00daaae14259]
spot_spotnodepool.this: Refreshing state...
terraform_data.setup_spotctl_config: Refreshing state... [id=28e19691-e59e-726f-789c-9b6a9601c876]
terraform_data.wait_for_cluster: Refreshing state... [id=8f0c6fa6-7154-522e-2394-b016070fb522]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.local_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_file" "kubeconfig" {
      + content              = (known after apply)
      + content_base64       = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + filename             = "./kubeconfig.yaml"
      + id                   = (known after apply)
    }

  # terraform_data.fetch_kubeconfig will be created
  + resource "terraform_data" "fetch_kubeconfig" {
      + id               = (known after apply)
      + triggers_replace = [
          + (known after apply),
        ]
    }

  # terraform_data.wait_for_cluster is tainted, so it must be replaced
-/+ resource "terraform_data" "wait_for_cluster" {
      ~ id               = "8f0c6fa6-7154-522e-2394-b016070fb522" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ cluster_ca_certificate = (sensitive value)
  ~ cluster_endpoint       = "https://hcp-206cdc47-7edb-4f13-bf26-b1d8e5a458e4.spot.rackspace.com" -> (known after apply)
  ~ cluster_token          = (sensitive value)
  ~ kubeconfig_raw         = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.local_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_file" "kubeconfig" {
      + content              = (known after apply)
      + content_base64       = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + filename             = "./kubeconfig.yaml"
      + id                   = (known after apply)
    }

  # spot_cloudspace.this will be updated in-place
  # (imported from "matchpoint-github-actions-runners")
  ~ resource "spot_cloudspace" "this" {
      + bids                  = (known after apply)
        cloudspace_name       = "matchpoint-github-actions-runners"
        cni                   = "calico"
        deployment_type       = "gen2"
        first_ready_timestamp = "0001-01-01T00:00:00Z"
        hacontrol_plane       = false
        id                    = "matchpoint-github-actions-runners"
        kubernetes_version    = "1.31.1"
      + last_updated          = (known after apply)
        name                  = "matchpoint-github-actions-runners"
      + pending_allocations   = (known after apply)
        region                = "us-central-dfw-1"
        spotnodepool_ids      = [
            "e1db3e70-466a-44be-aa7b-00daaae14259",
        ]
      + wait_until_ready      = false
    }

  # spot_spotnodepool.this will be updated in-place
  # (imported from "e1db3e70-466a-44be-aa7b-00daaae14259")
  ~ resource "spot_spotnodepool" "this" {
      + autoscaling          = {
          + max_nodes = 15
          + min_nodes = 2
        }
        bid_price            = 0.28
        bid_status           = "Fulfilled"
        cloudspace_name      = "matchpoint-github-actions-runners"
      ~ desired_server_count = 2 -> (known after apply)
        id                   = "e1db3e70-466a-44be-aa7b-00daaae14259"
      + last_updated         = (known after apply)
        name                 = "e1db3e70-466a-44be-aa7b-00daaae14259"
        server_class         = "gp.vs1.large-dfw"
        won_count            = 2
    }

  # terraform_data.fetch_kubeconfig will be created
  + resource "terraform_data" "fetch_kubeconfig" {
      + id               = (known after apply)
      + triggers_replace = [
          + (known after apply),
        ]
    }

  # terraform_data.setup_spotctl_config will be created
  + resource "terraform_data" "setup_spotctl_config" {
      + id               = (known after apply)
      + triggers_replace = [
          + "matchpoint-github-actions-runners",
        ]
    }

  # terraform_data.wait_for_cluster will be created
  + resource "terraform_data" "wait_for_cluster" {
      + id               = (known after apply)
      + triggers_replace = [
          + (known after apply),
        ]
    }

Plan: 2 to import, 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + cloudspace_name        = "matchpoint-github-actions-runners"
  + cluster_ca_certificate = (sensitive value)
  + cluster_endpoint       = (known after apply)
  + cluster_token          = (sensitive value)
  + kubeconfig_raw         = (sensitive value)
  + node_scaling           = {
      + max = 15
      + min = 2
    }
  + nodepool_name          = "e1db3e70-466a-44be-aa7b-00daaae14259"
  + region                 = "us-central-dfw-1"
  + server_class           = "gp.vs1.large-dfw"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```
</details>